check_status.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"
                 xmlns:ns="spyne.workflow.soap">
    <soap12:Header/>
    <soap12:Body>
        <ns:check_status>
            <ns:custom_id>{{status}}</ns:custom_id>
        </ns:check_status>
    </soap12:Body>
</soap12:Envelope>